### Terraform plan for prod
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg]
azurerm_app_service_plan.default: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan]
azurerm_app_service.website: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/ga-onlinestore-prod-website]
azurerm_app_service.api: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/ga-onlinestore-prod-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_service.api must be replaced
-/+ resource "azurerm_app_service" "api" {
      ~ app_service_plan_id               = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan" -> (known after apply)
      ~ app_settings                      = {} -> (known after apply)
      ~ custom_domain_verification_id     = "07DB0791BDA37D978A8998D569DEC5B13A26C980879CB8B137452713E322E275" -> (known after apply)
      ~ default_site_hostname             = "ga-onlinestore-prod-api.azurewebsites.net" -> (known after apply)
      ~ id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/ga-onlinestore-prod-api" -> (known after apply)
      ~ location                          = "northeurope" -> "eastus" # forces replacement
      ~ name                              = "ga-onlinestore-prod-api" -> "os-onlinestore-prod-api" # forces replacement
      ~ outbound_ip_address_list          = [
          - "20.67.200.168",
          - "20.67.200.231",
          - "20.67.200.247",
          - "20.67.200.255",
          - "20.67.201.20",
          - "20.67.201.27",
          - "20.50.64.10",
        ] -> (known after apply)
      ~ outbound_ip_addresses             = "20.67.200.168,20.67.200.231,20.67.200.247,20.67.200.255,20.67.201.20,20.67.201.27,20.50.64.10" -> (known after apply)
      ~ possible_outbound_ip_address_list = [
          - "20.67.200.168",
          - "20.67.200.231",
          - "20.67.200.247",
          - "20.67.200.255",
          - "20.67.201.20",
          - "20.67.201.27",
          - "20.67.201.45",
          - "20.67.200.185",
          - "20.67.201.66",
          - "20.67.201.93",
          - "20.67.201.112",
          - "20.67.202.194",
          - "20.67.202.203",
          - "20.67.202.215",
          - "20.67.202.241",
          - "20.67.202.255",
          - "20.67.203.17",
          - "20.67.203.24",
          - "20.93.122.226",
          - "20.93.121.168",
          - "20.93.123.41",
          - "20.93.123.42",
          - "20.93.123.55",
          - "20.93.123.56",
          - "20.50.64.10",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses    = "20.67.200.168,20.67.200.231,20.67.200.247,20.67.200.255,20.67.201.20,20.67.201.27,20.67.201.45,20.67.200.185,20.67.201.66,20.67.201.93,20.67.201.112,20.67.202.194,20.67.202.203,20.67.202.215,20.67.202.241,20.67.202.255,20.67.203.17,20.67.203.24,20.93.122.226,20.93.121.168,20.93.123.41,20.93.123.42,20.93.123.55,20.93.123.56,20.50.64.10" -> (known after apply)
      ~ site_credential                   = [
          - {
              - password = "hiamEg9EfSvEvBM2eoc0tcK6HpSeoqdAWdosHw8LY9Yp9aTYxjq8rKHyHhGP"
              - username = "$ga-onlinestore-prod-api"
            },
        ] -> (known after apply)
      - tags                              = {} -> null
        # (5 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "9a54817e-4fb3-4be6-ba26-c3a7336b62a2" -> (known after apply)
          ~ tenant_id    = "e67c1589-4747-4b73-b7bb-da1b567ee1f5" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ logs {
          ~ detailed_error_messages_enabled = false -> (known after apply)
          ~ failed_request_tracing_enabled  = false -> (known after apply)

          ~ application_logs {
              ~ file_system_level = "Off" -> (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          ~ http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      ~ site_config {
          - default_documents           = [] -> null
          ~ ftps_state                  = "AllAllowed" -> (known after apply)
          ~ ip_restriction              = [] -> (known after apply)
          ~ local_mysql_enabled         = false -> (known after apply)
          ~ managed_pipeline_mode       = "Integrated" -> (known after apply)
          ~ min_tls_version             = "1.2" -> (known after apply)
          ~ number_of_workers           = 1 -> (known after apply)
          ~ remote_debugging_version    = "VS2019" -> (known after apply)
          ~ scm_ip_restriction          = [] -> (known after apply)
          ~ scm_type                    = "None" -> (known after apply)
          ~ websockets_enabled          = false -> (known after apply)
          + windows_fx_version          = (known after apply)
            # (7 unchanged attributes hidden)

          ~ cors {
              ~ allowed_origins     = [] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }

      ~ source_control {
          ~ branch             = "master" -> (known after apply)
          ~ manual_integration = false -> (known after apply)
          + repo_url           = (known after apply)
          ~ rollback_enabled   = false -> (known after apply)
          ~ use_mercurial      = false -> (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_app_service.website must be replaced
-/+ resource "azurerm_app_service" "website" {
      ~ app_service_plan_id               = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan" -> (known after apply)
      ~ app_settings                      = {} -> (known after apply)
      ~ custom_domain_verification_id     = "07DB0791BDA37D978A8998D569DEC5B13A26C980879CB8B137452713E322E275" -> (known after apply)
      ~ default_site_hostname             = "ga-onlinestore-prod-website.azurewebsites.net" -> (known after apply)
      ~ id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/ga-onlinestore-prod-website" -> (known after apply)
      ~ location                          = "northeurope" -> "eastus" # forces replacement
      ~ name                              = "ga-onlinestore-prod-website" -> "os-onlinestore-prod-website" # forces replacement
      ~ outbound_ip_address_list          = [
          - "20.67.200.168",
          - "20.67.200.231",
          - "20.67.200.247",
          - "20.67.200.255",
          - "20.67.201.20",
          - "20.67.201.27",
          - "20.50.64.10",
        ] -> (known after apply)
      ~ outbound_ip_addresses             = "20.67.200.168,20.67.200.231,20.67.200.247,20.67.200.255,20.67.201.20,20.67.201.27,20.50.64.10" -> (known after apply)
      ~ possible_outbound_ip_address_list = [
          - "20.67.200.168",
          - "20.67.200.231",
          - "20.67.200.247",
          - "20.67.200.255",
          - "20.67.201.20",
          - "20.67.201.27",
          - "20.67.201.45",
          - "20.67.200.185",
          - "20.67.201.66",
          - "20.67.201.93",
          - "20.67.201.112",
          - "20.67.202.194",
          - "20.67.202.203",
          - "20.67.202.215",
          - "20.67.202.241",
          - "20.67.202.255",
          - "20.67.203.17",
          - "20.67.203.24",
          - "20.93.122.226",
          - "20.93.121.168",
          - "20.93.123.41",
          - "20.93.123.42",
          - "20.93.123.55",
          - "20.93.123.56",
          - "20.50.64.10",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses    = "20.67.200.168,20.67.200.231,20.67.200.247,20.67.200.255,20.67.201.20,20.67.201.27,20.67.201.45,20.67.200.185,20.67.201.66,20.67.201.93,20.67.201.112,20.67.202.194,20.67.202.203,20.67.202.215,20.67.202.241,20.67.202.255,20.67.203.17,20.67.203.24,20.93.122.226,20.93.121.168,20.93.123.41,20.93.123.42,20.93.123.55,20.93.123.56,20.50.64.10" -> (known after apply)
      ~ site_credential                   = [
          - {
              - password = "0BsXsHaHHJYuWmor7ijtSpLraLhtnyfqxFhCWjuoWigrhRzWtGYW7vEzYhLF"
              - username = "$ga-onlinestore-prod-website"
            },
        ] -> (known after apply)
      - tags                              = {} -> null
        # (5 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "1b03868f-9792-4b3a-9a6d-c50a2c988ea6" -> (known after apply)
          ~ tenant_id    = "e67c1589-4747-4b73-b7bb-da1b567ee1f5" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ logs {
          ~ detailed_error_messages_enabled = false -> (known after apply)
          ~ failed_request_tracing_enabled  = false -> (known after apply)

          ~ application_logs {
              ~ file_system_level = "Off" -> (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          ~ http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      ~ site_config {
          - default_documents           = [] -> null
          ~ ftps_state                  = "AllAllowed" -> (known after apply)
          ~ ip_restriction              = [] -> (known after apply)
          ~ local_mysql_enabled         = false -> (known after apply)
          ~ managed_pipeline_mode       = "Integrated" -> (known after apply)
          ~ min_tls_version             = "1.2" -> (known after apply)
          ~ number_of_workers           = 1 -> (known after apply)
          ~ remote_debugging_version    = "VS2019" -> (known after apply)
          ~ scm_ip_restriction          = [] -> (known after apply)
          ~ scm_type                    = "None" -> (known after apply)
          ~ websockets_enabled          = false -> (known after apply)
          + windows_fx_version          = (known after apply)
            # (7 unchanged attributes hidden)

          ~ cors {
              ~ allowed_origins     = [] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }

      ~ source_control {
          ~ branch             = "master" -> (known after apply)
          ~ manual_integration = false -> (known after apply)
          + repo_url           = (known after apply)
          ~ rollback_enabled   = false -> (known after apply)
          ~ use_mercurial      = false -> (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_app_service_plan.default must be replaced
-/+ resource "azurerm_app_service_plan" "default" {
      ~ id                           = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan" -> (known after apply)
      - is_xenon                     = false -> null
      ~ kind                         = "linux" -> "Linux"
      ~ location                     = "northeurope" -> "eastus" # forces replacement
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ maximum_number_of_workers    = 1 -> (known after apply)
        name                         = "onlinestore-plan"
      - per_site_scaling             = false -> null
      - tags                         = {} -> null
        # (2 unchanged attributes hidden)

      ~ sku {
          ~ capacity = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_resource_group.default must be replaced
-/+ resource "azurerm_resource_group" "default" {
      ~ id       = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg" -> (known after apply)
      ~ location = "northeurope" -> "eastus" # forces replacement
        name     = "onlinestore-prod-rg"
      - tags     = {} -> null
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ app_service_name_api     = "ga-onlinestore-prod-api" -> "os-onlinestore-prod-api"
  ~ app_service_name_website = "ga-onlinestore-prod-website" -> "os-onlinestore-prod-website"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @benchiverton, Action: `pull_request`, Working Directory: ``, Workflow: `Prod - plan`*